Dlubal.RFEM5.IIsolines
Interface for working with isolines

Dlubal.RFEM5.IIsolines.GetLayerCount
Gets count of layers.
Returns: Count of layers

Dlubal.RFEM5.IIsolines.GetLayers
Gets array of layers.
Returns: Array of layers

Dlubal.RFEM5.IIsolines.GetArcCount
Gets count of arcs.
Returns: Count of arcs

Dlubal.RFEM5.IIsolines.GetArcs
Gets array of arcs.
Returns: Array of arcs

Dlubal.RFEM5.IIsolines.GetCircleCount
Gets count of circles.
Returns: Count of circles

Dlubal.RFEM5.IIsolines.GetCircles
Gets array of circles.
Returns: Array of circles

Dlubal.RFEM5.IIsolines.GetLineCount
Gets count of lines.
Returns: Count of lines

Dlubal.RFEM5.IIsolines.GetLines
Gets array of lines.
Returns: Array of lines

Dlubal.RFEM5.IIsolines.GetPointCount
Gets count of points.
Returns: Count of points

Dlubal.RFEM5.IIsolines.GetPoints
Gets array of points.
Returns: Array of points

Dlubal.RFEM5.IIsolines.GetStyleCount
Gets count of styles.
Returns: Count of styles

Dlubal.RFEM5.IIsolines.GetStyles
Gets array of styles.
Returns: Array of styles

Dlubal.RFEM5.IIsolines.GetTextCount
Gets count of texts.
Returns: Count of text

Dlubal.RFEM5.IIsolines.GetTexts
Gets array of text.
Returns: Array of text